/************************************************
文件 : uart2.h
描述 ：用定时器2作为串口时钟 
编写 : 朱林
目标MCU：AT89S52
晶振：11.0592MHZ
************************************************/

#include <AT89X52.h>
#include <stdio.h>
#include<BoeBot.h>
#include<MATH.H>

#define uint unsigned int 
#define uchar unsigned char 

/*----------------------------------------------------------------
      函数名：Time2_init( ) 
      功  能：使用T2做串口时钟
-----------------------------------------------------------------*/
void Time2_init(void)
{
	EA = 1;
	T2MOD = 0; 
	T2CON |= 0x10;
	SCON = 0x50 ;
	TH2 = (65536 - 36)/256;
	TL2 = (65536-36)%256;
	RCAP2H = (65536 - 36)/256;
	RCAP2L =(65536 - 36)%256;
	TR2 = 1;	 
	TI = 1;
}



